
# make content groups from back cover text (takzir)

# run the  search_prog.py program in idle or pycharm etc

proza = [
    [{"פרוזה": []}],
    [{"ספרים מרגיעים ומנחמים"]}],
    [{"טייסים": ["טייס", "טיסה", "חיל האוויר"]}],
    [{"ספרים מצחיקים": ["משעשע", "מבדר", "מצחיק"]}],
    [{"מבוסס על סיפור אמיתי": ["המבוסס על חייהם", "סיפורה האמיתי", "סיפורו האמיתי"]}],
    [{"רומן היסטורי": ["הרומן ההיסטורי"]}],
    [{'להטב״ק': []}],
    [{"אימוץ": ["לאמץ תינוק", "הורים מאמצים",]}],
    [{"רומן גרפי": []}],
    [{"קומיקס": []}],

    [{"ארכיאולוגיה": ["ארכיאולוג"]}],
    [{"התאבדות": []}],
    [{"שנות השבעים": ["סבנטיז", "שנת שבעים"]}],
    [{"רומן ריגול": ["ריגול", "מרגל", "המוסד", "CIA", "סי.איי.איי"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"יחסים מסוכנים": ["ניצול רגשי", "ניצול מיני", "אונס", "מניפולטיבי", "כופה", "תקיפה מינית"]}],
    [{"מונולוגים": ["מונולוג"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"צדק חברתי": ["צדק", "גלובליז", "מחא", "מהפכ"]}],
    [{"בדואים": ["בדואי", "בדווי"]}],
    [{"סיני": []}],
    [{"מלחמת לבנון השנייה": ["לבנון השני"]}],
    [{"רומן עתידני": ["עתידני"]}],
    [{"רומן פילוסופי": ["פילוסופי"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
    [{"מתחזים": ["התחז", "מתחז", "זהות בדויה", "זהות שנגנבה"]}],

    [{"מדינות וערים": []}],
    [{"איטליה": ["סיציליה", ]}],
    [{"ניו יורק": ["מנהטן"]}],
]

proza_makor=[
    [{"פרוזה מקור": []}],
    [{"קיבוץ@": ["בן הקיבוץ",]}],
]

proza_tirgum=[
    [{"פרוזה תרגום": []}],
    [{"רומן היסטורי אמריקאי": []}],
    [{"סדרת חוצפנית": ["הסדרה חוצפנית"]}],

]

action=[
    [{"מתח ופעולה": []}],
    [{"מותחן פסיכולוגי": []}],
    [{"שנות השבעים": ["סבנטיז", "שנת שבעים"]}],
    [{"סדרת הפקד מגרה": ["פקד מגרה"]}],
]

romantica=[
    [{"רומן רומנטי": []}],
    [{"רומנטיקת נקמה": []}],
    [{"יוונים רומנטיים": ["ליוון", "המאפיה היוונית"]}],
    [{"יחסים מסוכנים": ["ניצול רגשי", "ניצול מיני", "אונס", "מניפולטיבי", "כופה", "תקיפה מינית"]}],
]

erotica=[
    [{"רומן אירוטי": []}],
    [{"ארוטיקה אפלה": ["ארוטי ואפל",]}],
    [{"יחסים מסוכנים": ["ניצול רגשי", "ניצול מיני", "אונס", "מניפולטיבי", "כופה", "תקיפה מינית"]}],
]

eyuin=[
    [{"עיון@": []}],
    [{"אמנות": ["האמנות החזותית",]}],
    [{"פשיזם": ["פשיזם", "פאשיזם"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"מונולוגים": ["מונולוג"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"צדק חברתי": ["צדק", "גלובליז", "מחא", "מהפכ"]}],
    [{"בדואים": ["בדואי", "בדווי"]}],
    [{"זכויות אדם": ["זכויות"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
]

fantasy=[
    [{'מד״ב ופנטזיה': []}],
    [{"מדע בדיוני": []}],
    [{"פנטזיה": ["מסע פנטסטי",]}],
    [{"פנטזיה קומית": ["מצחיק", "צחוק", "קומי", "קומדיה", "משעשע"]}],
    [{"פנטזיה אפית": ["אפי", "שר הטבעות", "משחקי הכס"]}],
    [{"רומן עתידני": ["עתידני"]}],
]

children_and_teenagers=[
    [{"ילדים ונוער": []}],
    [{"יום הולדת לילדים": ["יום הולדת", "יומולדת"]}],
    [{"קבלת השונה": []}],
]

babies=[
    [{"פעוטות": []}],
    [{"סבא וסבתא": ["סבא", "נכדתו"]}],
]

kinder=[
    [{"ילדי גן": []}],
    [{"סבא וסבתא": ["סבא", "נכדתו", "סבַּאָ"]}],
    [{"פחדי ילדים": ["פּחְדָיִם", "חַרֲדָוֹת"]}],
    [{"בעלי חיים לילדים": ["חַתֲוּליִם", "חָתוּל" "קיפוד", "שועלה", "תיש" "קרנף", "זיקית", "קוֹף", "נָמֵר" "פיל", "דָּג", "כלבלב", "כֶּלֶב", "כלבה", "צָב", "אַרְנָב", "דְּבוֹרָה", "תּוֹלַעַת", "חַיּוֹת", "פִּינְגְוִין"]}],
    [{"יום הולדת לילדים": ["יום הולדת", "יומולדת"]}],
]

start_reading=[
    [{"ראשית קריאה": []}],
    [{"סבא וסבתא": ["סבא", "נכדתו"]}],
    [{"שירים לילדים": []}],
    [{"דילמות של ילדים": ["שיימינג"]}],
]

young_teenagers=[
    [{"נוער צעיר": []}],
    [{"דילמות של ילדים": ["שיימינג"]}],
]

old_teenagers=[
    [{"נוער בוגר": []}],
    [{"תיכון@": []}],
]

holocaust=[
    [{"שואה": []}],
    [{"הצלה בשואה": ["הצלת יהודים"]}],
]

judaism=[
    [{"יהדות": []}],
    [{"תלמוד": ['חז״ל']}],
]

advice=[
    [{"מדריכים ועצות": []}],
    [{"עזרה עצמית": []}],
]

business=[
    [{"עסקים וניהול": []}],
    [{"אסטרטגיה עסקית": []}],
]

history_and_politics=[
    [{"היסטוריה ופוליטיקה": []}],
    [{"פוליטיקה": ["הפוליטיקה הישראלית"]}],
    [{"פשיזם": ["פשיזם", "פאשיזם"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"צדק חברתי": ["צדק", "גלובליז", "מחא", "מהפכ"]}],
    [{"בדואים": ["בדואי", "בדווי"]}],
    [{"סיני": []}],
    [{"זכויות אדם": ["זכויות"]}],
    [{"מלחמת לבנון השנייה": ["לבנון השני"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
]

biography=[
    [{"ביוגרפיה": []}],
    [{"ביוגרפיות": []}],
    [{"אוטוביוגרפיה": ["אוטוביוגרפי"]}],
    [{"פשיזם": ["פשיזם", "פאשיזם"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"מונולוגים": ["מונולוג"]}],
    [{"נוסטלגיה": ["נוסטלגי", "געגועים לתקופ", "געגוע לימים", "געגוע לשנות"]}],
    [{"סחר בבני אדם": ["עבדות", "סחר בנשים", "סחר בבני"]}],
]

health=[
    [{"בריאות": []}],
    [{"מדע ורפואה": ["בריאות הציבור"]}],
]

psychology=[
    [{"פסיכולוגיה": []}],
    [{"פסיכואנליזה": []}],
    [{"פסיכותרפיה": ["טיפול נפשי", "הטיפול הנפשי"]}],
    [{"הלם קרב": ["פוסט טראומ"]}],
    [{"מונולוגים": ["מונולוג"]}],
]

parenting=[
    [{"הורות וזוגיות": []}],
    [{"מיניות": []}],
]

philosophy=[
    [{"הגות ופילוסופיה": []}],
    [{"פילוסופיה": ["פילוסופים"]}],
    [{"צדק חברתי": ["צדק", "גלובליז", "מחא", "מהפכ"]}],
]

spirituality=[
    [{"רוחניות": []}],
    [{"עידן חדש": ["הניו אייג'"]}],
]

traveling=[
    [{"טיולים ופנאי": []}],
    [{"טיולים בארץ": []}],
]

cooking=[
    [{"בישול": []}],
    [{"מתכונים וסיפורים": []}],
]

poem=[
    [{"שירה": []}],
    [{"שירה עברית": []}],
]

all_groups = [proza, proza_makor, proza_tirgum, action, romantica, erotica,
              eyuin, fantasy, children_and_teenagers, babies, kinder, start_reading, young_teenagers, old_teenagers,
              holocaust, judaism, advice, business, history_and_politics, biography, health,
              psychology, parenting, philosophy, spirituality, traveling, cooking, poem]
all_groups_str = ["פרוזה", "פרוזה מקור", "פרוזה תרגום", "מתח ופעולה", "רומן רומנטי", "רומן אירוטי",
                  "עיון", 'מד״ב ופנטזיה', "ילדים ונוער", "פעוטות", "ילדי גן", "ראשית קריאה", "נוער צעיר", "נוער בוגר",
                  "שואה", "יהדות", "מדריכים ועצות", "עסקים וניהול", "היסטוריה ופוליטיקה", "ביוגרפיה", "בריאות",
                  "פסיכולוגיה", "הורות וזוגיות", "הגות ופילוסופיה", "רוחניות", "טיולים ופנאי", "בישול", "שירה"]
